## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-   destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.DownloadGrantsGovDB.data.aws_iam_policy_document.allow_invoke_lambda will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "allow_invoke_lambda" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "lambda:InvokeFunction",
            ]
+           effect    = "Allow"
+           resources = [
+               (known after apply),
+               (known after apply),
            ]
+           sid       = "AllowInvokeLambda"
        }
    }

  # module.DownloadGrantsGovDB.aws_iam_role.scheduler_execution[0] will be created
+   resource "aws_iam_role" "scheduler_execution" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Condition = {
+                           StringEquals = {
+                               "aws:SourceAccount" = "357150818708"
                            }
                        }
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "scheduler.amazonaws.com"
                        }
+                       Sid       = "AssumeRole"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = (known after apply)
+       name_prefix           = "grants_ingest-staging-scheduler_exec"
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.DownloadGrantsGovDB.aws_iam_role_policy.scheduler_execution-allow_invoke_lambda[0] will be created
+   resource "aws_iam_role_policy" "scheduler_execution-allow_invoke_lambda" {
+       id     = (known after apply)
+       name   = (known after apply)
+       policy = (known after apply)
+       role   = (known after apply)
    }

  # module.DownloadGrantsGovDB.aws_scheduler_schedule.default[0] will be created
+   resource "aws_scheduler_schedule" "default" {
+       arn                          = (known after apply)
+       description                  = "Invokes a Lambda function daily to download the Grants.gov DB extract"
+       group_name                   = "grants_ingest-staging"
+       id                           = (known after apply)
+       name                         = "grants_ingest-staging-DownloadGrantsGovDB"
+       name_prefix                  = (known after apply)
+       schedule_expression          = "cron(0 5 * * ? *)"
+       schedule_expression_timezone = "America/New_York"
+       state                        = "ENABLED"

+       flexible_time_window {
+           maximum_window_in_minutes = 15
+           mode                      = "FLEXIBLE"
        }

+       target {
+           arn      = (known after apply)
+           input    = jsonencode(
                {
+                   timestamp = "<aws.scheduler.scheduled-time>"
                }
            )
+           role_arn = (known after apply)

+           retry_policy {
+               maximum_event_age_in_seconds = 21600
+               maximum_retry_attempts       = 185
            }
        }
    }

  # module.SplitGrantsGovXMLDB.aws_s3_bucket_notification.default will be created
+   resource "aws_s3_bucket_notification" "default" {
+       bucket      = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       eventbridge = false
+       id          = (known after apply)

+       lambda_function {
+           events              = [
+               "s3:ObjectCreated:*",
            ]
+           filter_prefix       = "sources/"
+           filter_suffix       = "/grants.gov/extract.xml"
+           id                  = (known after apply)
+           lambda_function_arn = (known after apply)
        }
    }

  # module.download_grants_gov_db.aws_iam_role.scheduler_execution[0] will be destroyed
  # (because aws_iam_role.scheduler_execution is not in configuration)
-   resource "aws_iam_role" "scheduler_execution" {
-       arn                   = "arn:aws:iam::357150818708:role/grants_ingest-staging-scheduler_exec20230327160725268500000001" -> null
-       assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Condition = {
-                           StringEquals = {
-                               "aws:SourceAccount" = "357150818708"
                            }
                        }
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "scheduler.amazonaws.com"
                        }
-                       Sid       = "AssumeRole"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       create_date           = "2023-03-27T16:07:25Z" -> null
-       force_detach_policies = false -> null
-       id                    = "grants_ingest-staging-scheduler_exec20230327160725268500000001" -> null
-       managed_policy_arns   = [] -> null
-       max_session_duration  = 3600 -> null
-       name                  = "grants_ingest-staging-scheduler_exec20230327160725268500000001" -> null
-       name_prefix           = "grants_ingest-staging-scheduler_exec" -> null
-       path                  = "/" -> null
-       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary" -> null
-       tags                  = {} -> null
-       tags_all              = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "grants-ingest"
-           "service"    = "grants-ingest"
-           "usage"      = "workload"
        } -> null
-       unique_id             = "AROAVGJ6ZAGKIAFDTWD4V" -> null

-       inline_policy {
-           name   = "terraform-20230327214441701200000001" -> null
-           policy = jsonencode(
                {
-                   Statement = [
-                       {
-                           Action   = "lambda:InvokeFunction"
-                           Effect   = "Allow"
-                           Resource = [
-                               "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:*",
-                               "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB",
                            ]
-                           Sid      = "AllowInvokeLambda"
                        },
                    ]
-                   Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.download_grants_gov_db.aws_iam_role_policy.scheduler_execution-allow_invoke_lambda[0] will be destroyed
  # (because aws_iam_role_policy.scheduler_execution-allow_invoke_lambda is not in configuration)
-   resource "aws_iam_role_policy" "scheduler_execution-allow_invoke_lambda" {
-       id     = "grants_ingest-staging-scheduler_exec20230327160725268500000001:terraform-20230327214441701200000001" -> null
-       name   = "terraform-20230327214441701200000001" -> null
-       policy = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "lambda:InvokeFunction"
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:*",
-                           "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB",
                        ]
-                       Sid      = "AllowInvokeLambda"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       role   = "grants_ingest-staging-scheduler_exec20230327160725268500000001" -> null
    }

  # module.download_grants_gov_db.aws_scheduler_schedule.default[0] will be destroyed
  # (because aws_scheduler_schedule.default is not in configuration)
-   resource "aws_scheduler_schedule" "default" {
-       arn                          = "arn:aws:scheduler:us-west-2:357150818708:schedule/grants_ingest-staging/grants_ingest-staging-DownloadGrantsGovDB" -> null
-       description                  = "Invokes a Lambda function daily to download the Grants.gov DB extract" -> null
-       group_name                   = "grants_ingest-staging" -> null
-       id                           = "grants_ingest-staging/grants_ingest-staging-DownloadGrantsGovDB" -> null
-       name                         = "grants_ingest-staging-DownloadGrantsGovDB" -> null
-       schedule_expression          = "cron(0 5 * * ? *)" -> null
-       schedule_expression_timezone = "America/New_York" -> null
-       state                        = "ENABLED" -> null

-       flexible_time_window {
-           maximum_window_in_minutes = 15 -> null
-           mode                      = "FLEXIBLE" -> null
        }

-       target {
-           arn      = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB" -> null
-           input    = jsonencode(
                {
-                   timestamp = "<aws.scheduler.scheduled-time>"
                }
            ) -> null
-           role_arn = "arn:aws:iam::357150818708:role/grants_ingest-staging-scheduler_exec20230327160725268500000001" -> null

-           retry_policy {
-               maximum_event_age_in_seconds = 21600 -> null
-               maximum_retry_attempts       = 185 -> null
            }
        }
    }

  # module.split_grants_gov_db.aws_s3_bucket_notification.default will be destroyed
  # (because aws_s3_bucket_notification.default is not in configuration)
-   resource "aws_s3_bucket_notification" "default" {
-       bucket      = "grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> null
-       eventbridge = false -> null
-       id          = "grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> null

-       lambda_function {
-           events              = [
-               "s3:ObjectCreated:*",
            ] -> null
-           filter_prefix       = "sources/" -> null
-           filter_suffix       = "/grants.gov/extract.xml" -> null
-           id                  = "tf-s3-lambda-20230331144314830500000003" -> null
-           lambda_function_arn = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB" -> null
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
+   resource "aws_cloudwatch_log_group" "lambda" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/aws/lambda/grants_ingest-staging-DownloadGrantsGovDB"
+       name_prefix       = (known after apply)
+       retention_in_days = 30
+       skip_destroy      = false
+       tags_all          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_iam_policy.additional_json[0] will be created
+   resource "aws_iam_policy" "additional_json" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "grants_ingest-staging-DownloadGrantsGovDB"
+       path      = "/"
+       policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "secretsmanager:GetSecretValue"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
+                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
+                   {
+                       Action   = "s3:PutObject"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/sources/*/*/*/grants.gov/archive.zip"
+                       Sid      = "AllowS3Upload"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id = (known after apply)
+       tags_all  = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_iam_policy.logs[0] will be created
+   resource "aws_iam_policy" "logs" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "grants_ingest-staging-DownloadGrantsGovDB-logs"
+       path      = "/"
+       policy    = (known after apply)
+       policy_id = (known after apply)
+       tags_all  = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_iam_role.lambda[0] will be created
+   resource "aws_iam_role" "lambda" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "grants_ingest-staging-DownloadGrantsGovDB"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0] will be created
+   resource "aws_iam_role_policy_attachment" "additional_json" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-DownloadGrantsGovDB"
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be created
+   resource "aws_iam_role_policy_attachment" "logs" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-DownloadGrantsGovDB"
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_function.this[0] will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = [
+           "arm64",
        ]
+       arn                            = (known after apply)
+       description                    = "Downloads and stores the daily XML database extract from Grants.gov"
+       function_name                  = "grants_ingest-staging-DownloadGrantsGovDB"
+       handler                        = "bootstrap"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = [
+           "arn:aws:lambda:us-west-2:464622532012:layer:Datadog-Extension-ARM:38",
        ]
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = true
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "provided.al2"
+       s3_bucket                      = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       s3_key                         = "builds/87cfc4577b670835b409a4af478d5a9ad41ab62efb119deeb8cf02acc152cac4.zip"
+       s3_object_version              = (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       timeout                        = 120
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "DD_API_KEY_SECRET_ARN"          = (sensitive value)
+               "DD_APM_ENABLED"                 = "true"
+               "DD_CAPTURE_LAMBDA_PAYLOAD"      = "true"
+               "DD_ENV"                         = "staging"
+               "DD_SERVERLESS_APPSEC_ENABLED"   = "true"
+               "DD_SERVICE"                     = "grants-ingest"
+               "DD_SITE"                        = "datadoghq.com"
+               "DD_TAGS"                        = "git.commit.sha:a1b12fb0743aaa3578318a83ce45ac7956ec377f,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:downloadgrantsgovdb"
+               "DD_TRACE_ENABLED"               = "true"
+               "DD_VERSION"                     = "a1b12fb0743aaa3578318a83ce45ac7956ec377f"
+               "GRANTS_GOV_BASE_URL"            = "https://www.grants.gov"
+               "GRANTS_SOURCE_DATA_BUCKET_NAME" = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+               "LOG_LEVEL"                      = "INFO"
+               "TZ"                             = "UTC"
            }
        }

+       ephemeral_storage {
+           size = 512
        }

+       tracing_config {
+           mode = (known after apply)
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-DownloadGrantsGovDB"
+       id                  = (known after apply)
+       principal           = "scheduler.amazonaws.com"
+       qualifier           = (known after apply)
+       source_arn          = (known after apply)
+       statement_id        = "Schedule"
+       statement_id_prefix = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["Schedule"] will be created
+   resource "aws_lambda_permission" "unqualified_alias_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-DownloadGrantsGovDB"
+       id                  = (known after apply)
+       principal           = "scheduler.amazonaws.com"
+       source_arn          = (known after apply)
+       statement_id        = "Schedule"
+       statement_id_prefix = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "builds/87cfc4577b670835b409a4af478d5a9ad41ab62efb119deeb8cf02acc152cac4.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "builds/87cfc4577b670835b409a4af478d5a9ad41ab62efb119deeb8cf02acc152cac4.zip"
+       storage_class          = "ONEZONE_IA"
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-DownloadGrantsGovDB
                            cd bin/DownloadGrantsGovDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/87cfc4577b670835b409a4af478d5a9ad41ab62efb119deeb8cf02acc152cac4.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/87cfc4577b670835b409a4af478d5a9ad41ab62efb119deeb8cf02acc152cac4.plan.json"
+       id                   = (known after apply)
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.archive[0] will be created
+   resource "null_resource" "archive" {
+       id       = (known after apply)
+       triggers = {
+           "filename"  = "builds/87cfc4577b670835b409a4af478d5a9ad41ab62efb119deeb8cf02acc152cac4.zip"
+           "timestamp" = "1680570601280852000"
        }
    }

  # module.DownloadGrantsGovDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] will be created
+   resource "null_resource" "sam_metadata_aws_lambda_function" {
+       id       = (known after apply)
+       triggers = {
+           "built_output_path"    = "builds/87cfc4577b670835b409a4af478d5a9ad41ab62efb119deeb8cf02acc152cac4.zip"
+           "original_source_code" = jsonencode(
                [
+                   {
+                       commands = [
+                           "task build-DownloadGrantsGovDB",
+                           "cd bin/DownloadGrantsGovDB",
+                           ":zip",
                        ]
+                       path     = "./.."
                    },
                ]
            )
+           "resource_name"        = "aws_lambda_function.this[0]"
+           "resource_type"        = "ZIP_LAMBDA_FUNCTION"
+           "source_code_property" = "path"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
+       id   = (known after apply)
+       json = (known after apply)

+       statement {
+           actions   = [
+               "logs:CreateLogGroup",
+               "logs:CreateLogStream",
+               "logs:PutLogEvents",
            ]
+           effect    = "Allow"
+           resources = (known after apply)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be created
+   resource "aws_cloudwatch_log_group" "lambda" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "/aws/lambda/grants_ingest-staging-SplitGrantsGovXMLDB"
+       name_prefix       = (known after apply)
+       retention_in_days = 30
+       skip_destroy      = false
+       tags_all          = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_iam_policy.additional_json[0] will be created
+   resource "aws_iam_policy" "additional_json" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "grants_ingest-staging-SplitGrantsGovXMLDB"
+       path      = "/"
+       policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = "secretsmanager:GetSecretValue"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
+                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
+                   {
+                       Action   = [
+                           "s3:ListBucket",
+                           "s3:GetObject",
                        ]
+                       Effect   = "Allow"
+                       Resource = [
+                           "arn:aws:s3:::grantsingest-staging-grantsprepareddata-357150818708-us-west-2/*/*/grants.gov/v2.xml",
+                           "arn:aws:s3:::grantsingest-staging-grantsprepareddata-357150818708-us-west-2",
                        ]
+                       Sid      = "AllowInspectS3PreparedData"
                    },
+                   {
+                       Action   = "s3:GetObject"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/sources/*/*/*/grants.gov/extract.xml"
+                       Sid      = "AllowS3DownloadSourceData"
                    },
+                   {
+                       Action   = "s3:PutObject"
+                       Effect   = "Allow"
+                       Resource = "arn:aws:s3:::grantsingest-staging-grantsprepareddata-357150818708-us-west-2/*/*/grants.gov/v2.xml"
+                       Sid      = "AllowS3UploadPreparedData"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id = (known after apply)
+       tags_all  = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_iam_policy.logs[0] will be created
+   resource "aws_iam_policy" "logs" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "grants_ingest-staging-SplitGrantsGovXMLDB-logs"
+       path      = "/"
+       policy    = (known after apply)
+       policy_id = (known after apply)
+       tags_all  = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_iam_role.lambda[0] will be created
+   resource "aws_iam_role" "lambda" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
+                       Sid       = ""
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = true
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "grants_ingest-staging-SplitGrantsGovXMLDB"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary"
+       tags_all              = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       unique_id             = (known after apply)

+       inline_policy {
+           name   = (known after apply)
+           policy = (known after apply)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0] will be created
+   resource "aws_iam_role_policy_attachment" "additional_json" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-SplitGrantsGovXMLDB"
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be created
+   resource "aws_iam_role_policy_attachment" "logs" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "grants_ingest-staging-SplitGrantsGovXMLDB"
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_function.this[0] will be created
+   resource "aws_lambda_function" "this" {
+       architectures                  = [
+           "arm64",
        ]
+       arn                            = (known after apply)
+       description                    = "Creates per-grant XML data files from a source Grants.gov XML DB extract."
+       function_name                  = "grants_ingest-staging-SplitGrantsGovXMLDB"
+       handler                        = "bootstrap"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       layers                         = [
+           "arn:aws:lambda:us-west-2:464622532012:layer:Datadog-Extension-ARM:38",
        ]
+       memory_size                    = 1024
+       package_type                   = "Zip"
+       publish                        = true
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "provided.al2"
+       s3_bucket                      = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       s3_key                         = "builds/c7ac354b833ea7b8550bc4f17f7cfec34ba83cc6fc15ad8e4ff28fc902edd0bd.zip"
+       s3_object_version              = (known after apply)
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       timeout                        = 300
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "DD_API_KEY_SECRET_ARN"            = (sensitive value)
+               "DD_APM_ENABLED"                   = "true"
+               "DD_CAPTURE_LAMBDA_PAYLOAD"        = "true"
+               "DD_ENV"                           = "staging"
+               "DD_SERVERLESS_APPSEC_ENABLED"     = "true"
+               "DD_SERVICE"                       = "grants-ingest"
+               "DD_SITE"                          = "datadoghq.com"
+               "DD_TAGS"                          = "git.commit.sha:a1b12fb0743aaa3578318a83ce45ac7956ec377f,git.repository_url:github.com/usdigitalresponse/grants-ingest,handlername:splitgrantsgovxmldb"
+               "DD_TRACE_ENABLED"                 = "true"
+               "DD_TRACE_RATE_LIMIT"              = "1000"
+               "DD_VERSION"                       = "a1b12fb0743aaa3578318a83ce45ac7956ec377f"
+               "DOWNLOAD_CHUNK_LIMIT"             = "20"
+               "GRANTS_PREPARED_DATA_BUCKET_NAME" = "grantsingest-staging-grantsprepareddata-357150818708-us-west-2"
+               "LOG_LEVEL"                        = "INFO"
+               "MAX_CONCURRENT_UPLOADS"           = "10"
+               "S3_USE_PATH_STYLE"                = "true"
+               "TZ"                               = "UTC"
            }
        }

+       ephemeral_storage {
+           size = 512
        }

+       tracing_config {
+           mode = (known after apply)
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] will be created
+   resource "aws_lambda_permission" "current_version_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-SplitGrantsGovXMLDB"
+       id                  = (known after apply)
+       principal           = "s3.amazonaws.com"
+       qualifier           = (known after apply)
+       source_arn          = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       statement_id        = "S3BucketNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"] will be created
+   resource "aws_lambda_permission" "unqualified_alias_triggers" {
+       action              = "lambda:InvokeFunction"
+       function_name       = "grants_ingest-staging-SplitGrantsGovXMLDB"
+       id                  = (known after apply)
+       principal           = "s3.amazonaws.com"
+       source_arn          = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2"
+       statement_id        = "S3BucketNotification"
+       statement_id_prefix = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.aws_s3_object.lambda_package[0] will be created
+   resource "aws_s3_object" "lambda_package" {
+       acl                    = "private"
+       bucket                 = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       content_type           = (known after apply)
+       etag                   = (known after apply)
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "builds/c7ac354b833ea7b8550bc4f17f7cfec34ba83cc6fc15ad8e4ff28fc902edd0bd.zip"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "builds/c7ac354b833ea7b8550bc4f17f7cfec34ba83cc6fc15ad8e4ff28fc902edd0bd.zip"
+       storage_class          = "ONEZONE_IA"
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "grants-ingest"
+           "service"    = "grants-ingest"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.local_file.archive_plan[0] will be created
+   resource "local_file" "archive_plan" {
+       content              = jsonencode(
            {
+               artifacts_dir = "builds"
+               build_plan    = [
+                   [
+                       "sh",
+                       "..",
+                       <<-EOT
                            task build-SplitGrantsGovXMLDB
                            cd bin/SplitGrantsGovXMLDB
                        EOT,
                    ],
+                   [
+                       "zip:embedded",
+                       "..",
+                       null,
                    ],
                ]
+               filename      = "builds/c7ac354b833ea7b8550bc4f17f7cfec34ba83cc6fc15ad8e4ff28fc902edd0bd.zip"
+               runtime       = "provided.al2"
            }
        )
+       content_base64sha256 = (known after apply)
+       content_base64sha512 = (known after apply)
+       content_md5          = (known after apply)
+       content_sha1         = (known after apply)
+       content_sha256       = (known after apply)
+       content_sha512       = (known after apply)
+       directory_permission = "0755"
+       file_permission      = "0644"
+       filename             = "builds/c7ac354b833ea7b8550bc4f17f7cfec34ba83cc6fc15ad8e4ff28fc902edd0bd.plan.json"
+       id                   = (known after apply)
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.archive[0] will be created
+   resource "null_resource" "archive" {
+       id       = (known after apply)
+       triggers = {
+           "filename"  = "builds/c7ac354b833ea7b8550bc4f17f7cfec34ba83cc6fc15ad8e4ff28fc902edd0bd.zip"
+           "timestamp" = "1680570601249694200"
        }
    }

  # module.SplitGrantsGovXMLDB.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] will be created
+   resource "null_resource" "sam_metadata_aws_lambda_function" {
+       id       = (known after apply)
+       triggers = {
+           "built_output_path"    = "builds/c7ac354b833ea7b8550bc4f17f7cfec34ba83cc6fc15ad8e4ff28fc902edd0bd.zip"
+           "original_source_code" = jsonencode(
                [
+                   {
+                       commands = [
+                           "task build-SplitGrantsGovXMLDB",
+                           "cd bin/SplitGrantsGovXMLDB",
+                           ":zip",
                        ]
+                       path     = "./.."
                    },
                ]
            )
+           "resource_name"        = "aws_lambda_function.this[0]"
+           "resource_type"        = "ZIP_LAMBDA_FUNCTION"
+           "source_code_property" = "path"
        }
    }

  # module.download_grants_gov_db.module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
-   resource "aws_cloudwatch_log_group" "lambda" {
-       arn               = "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-DownloadGrantsGovDB" -> null
-       id                = "/aws/lambda/grants_ingest-staging-DownloadGrantsGovDB" -> null
-       name              = "/aws/lambda/grants_ingest-staging-DownloadGrantsGovDB" -> null
-       retention_in_days = 30 -> null
-       skip_destroy      = false -> null
-       tags              = {} -> null
-       tags_all          = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "grants-ingest"
-           "service"    = "grants-ingest"
-           "usage"      = "workload"
        } -> null
    }

  # module.download_grants_gov_db.module.lambda_function.aws_iam_policy.additional_json[0] will be destroyed
  # (because aws_iam_policy.additional_json is not in configuration)
-   resource "aws_iam_policy" "additional_json" {
-       arn       = "arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadGrantsGovDB" -> null
-       id        = "arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadGrantsGovDB" -> null
-       name      = "grants_ingest-staging-DownloadGrantsGovDB" -> null
-       path      = "/" -> null
-       policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "secretsmanager:GetSecretValue"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
-                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
-                   {
-                       Action   = "s3:PutObject"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/sources/*/*/*/grants.gov/archive.zip"
-                       Sid      = "AllowS3Upload"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       policy_id = "ANPAVGJ6ZAGKJTZ2YVTSB" -> null
-       tags      = {} -> null
-       tags_all  = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "grants-ingest"
-           "service"    = "grants-ingest"
-           "usage"      = "workload"
        } -> null
    }

  # module.download_grants_gov_db.module.lambda_function.aws_iam_policy.logs[0] will be destroyed
  # (because aws_iam_policy.logs is not in configuration)
-   resource "aws_iam_policy" "logs" {
-       arn       = "arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadGrantsGovDB-logs" -> null
-       id        = "arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadGrantsGovDB-logs" -> null
-       name      = "grants_ingest-staging-DownloadGrantsGovDB-logs" -> null
-       path      = "/" -> null
-       policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-DownloadGrantsGovDB:*:*",
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-DownloadGrantsGovDB:*",
                        ]
-                       Sid      = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       policy_id = "ANPAVGJ6ZAGKCRIY3IZUV" -> null
-       tags      = {} -> null
-       tags_all  = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "grants-ingest"
-           "service"    = "grants-ingest"
-           "usage"      = "workload"
        } -> null
    }

  # module.download_grants_gov_db.module.lambda_function.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
-   resource "aws_iam_role" "lambda" {
-       arn                   = "arn:aws:iam::357150818708:role/grants_ingest-staging-DownloadGrantsGovDB" -> null
-       assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "lambda.amazonaws.com"
                        }
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       create_date           = "2023-03-27T16:07:25Z" -> null
-       force_detach_policies = true -> null
-       id                    = "grants_ingest-staging-DownloadGrantsGovDB" -> null
-       managed_policy_arns   = [
-           "arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadGrantsGovDB",
-           "arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadGrantsGovDB-logs",
        ] -> null
-       max_session_duration  = 3600 -> null
-       name                  = "grants_ingest-staging-DownloadGrantsGovDB" -> null
-       path                  = "/" -> null
-       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary" -> null
-       tags                  = {} -> null
-       tags_all              = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "grants-ingest"
-           "service"    = "grants-ingest"
-           "usage"      = "workload"
        } -> null
-       unique_id             = "AROAVGJ6ZAGKLDEOGAT7I" -> null
    }

  # module.download_grants_gov_db.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0] will be destroyed
  # (because aws_iam_role_policy_attachment.additional_json is not in configuration)
-   resource "aws_iam_role_policy_attachment" "additional_json" {
-       id         = "grants_ingest-staging-DownloadGrantsGovDB-20230327212755741300000002" -> null
-       policy_arn = "arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadGrantsGovDB" -> null
-       role       = "grants_ingest-staging-DownloadGrantsGovDB" -> null
    }

  # module.download_grants_gov_db.module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be destroyed
  # (because aws_iam_role_policy_attachment.logs is not in configuration)
-   resource "aws_iam_role_policy_attachment" "logs" {
-       id         = "grants_ingest-staging-DownloadGrantsGovDB-20230327212755708000000001" -> null
-       policy_arn = "arn:aws:iam::357150818708:policy/grants_ingest-staging-DownloadGrantsGovDB-logs" -> null
-       role       = "grants_ingest-staging-DownloadGrantsGovDB" -> null
    }

  # module.download_grants_gov_db.module.lambda_function.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
-   resource "aws_lambda_function" "this" {
-       architectures                  = [
-           "arm64",
        ] -> null
-       arn                            = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB" -> null
-       code_signing_config_arn        = "" -> null
-       description                    = "Downloads and stores the daily XML database extract from Grants.gov" -> null
-       function_name                  = "grants_ingest-staging-DownloadGrantsGovDB" -> null
-       handler                        = "bootstrap" -> null
-       id                             = "grants_ingest-staging-DownloadGrantsGovDB" -> null
-       image_uri                      = "" -> null
-       invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB/invocations" -> null
-       kms_key_arn                    = "" -> null
-       last_modified                  = "2023-04-01T02:05:09.000+0000" -> null
-       layers                         = [
-           "arn:aws:lambda:us-west-2:464622532012:layer:Datadog-Extension-ARM:38",
        ] -> null
-       memory_size                    = 128 -> null
-       package_type                   = "Zip" -> null
-       publish                        = true -> null
-       qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:3" -> null
-       qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-DownloadGrantsGovDB:3/invocations" -> null
-       reserved_concurrent_executions = -1 -> null
-       role                           = "arn:aws:iam::357150818708:role/grants_ingest-staging-DownloadGrantsGovDB" -> null
-       runtime                        = "provided.al2" -> null
-       s3_bucket                      = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2" -> null
-       s3_key                         = "builds/f97293dffef695cab655eeecc664e8c34c164ae0090612444da3fe68c81ec174.zip" -> null
-       s3_object_version              = "9uHcQ_fjZI0LxcvFT.6i5876XlR8ArnM" -> null
-       signing_job_arn                = "" -> null
-       signing_profile_version_arn    = "" -> null
-       source_code_hash               = "sIvb8LQXecKJpDXv11o+oJHCob9i3UTAIPuMSVGPTbk=" -> null
-       source_code_size               = 6789720 -> null
-       tags                           = {} -> null
-       tags_all                       = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "grants-ingest"
-           "service"    = "grants-ingest"
-           "usage"      = "workload"
        } -> null
-       timeout                        = 120 -> null
-       version                        = "3" -> null

-       environment {
-           variables = {
-               "DD_API_KEY_SECRET_ARN"          = (sensitive value)
-               "DD_APM_ENABLED"                 = "true"
-               "DD_CAPTURE_LAMBDA_PAYLOAD"      = "true"
-               "DD_ENV"                         = "staging"
-               "DD_SERVERLESS_APPSEC_ENABLED"   = "true"
-               "DD_SERVICE"                     = "grants-ingest"
-               "DD_SITE"                        = "datadoghq.com"
-               "DD_TRACE_ENABLED"               = "true"
-               "DD_VERSION"                     = "9253eef759c6c58f46e3ac0e274052c3c2422bb9"
-               "GRANTS_GOV_BASE_URL"            = "https://www.grants.gov"
-               "GRANTS_SOURCE_DATA_BUCKET_NAME" = "grantsingest-staging-grantssourcedata-357150818708-us-west-2"
-               "LOG_LEVEL"                      = "INFO"
-               "TZ"                             = "UTC"
            } -> null
        }

-       ephemeral_storage {
-           size = 512 -> null
        }

-       tracing_config {
-           mode = "PassThrough" -> null
        }
    }

  # module.download_grants_gov_db.module.lambda_function.aws_lambda_permission.current_version_triggers["Schedule"] will be destroyed
  # (because aws_lambda_permission.current_version_triggers is not in configuration)
-   resource "aws_lambda_permission" "current_version_triggers" {
-       action        = "lambda:InvokeFunction" -> null
-       function_name = "grants_ingest-staging-DownloadGrantsGovDB" -> null
-       id            = "Schedule" -> null
-       principal     = "scheduler.amazonaws.com" -> null
-       qualifier     = "3" -> null
-       source_arn    = "arn:aws:scheduler:us-west-2:357150818708:schedule/grants_ingest-staging/grants_ingest-staging-DownloadGrantsGovDB" -> null
-       statement_id  = "Schedule" -> null
    }

  # module.download_grants_gov_db.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["Schedule"] will be destroyed
  # (because aws_lambda_permission.unqualified_alias_triggers is not in configuration)
-   resource "aws_lambda_permission" "unqualified_alias_triggers" {
-       action        = "lambda:InvokeFunction" -> null
-       function_name = "grants_ingest-staging-DownloadGrantsGovDB" -> null
-       id            = "Schedule" -> null
-       principal     = "scheduler.amazonaws.com" -> null
-       source_arn    = "arn:aws:scheduler:us-west-2:357150818708:schedule/grants_ingest-staging/grants_ingest-staging-DownloadGrantsGovDB" -> null
-       statement_id  = "Schedule" -> null
    }

  # module.download_grants_gov_db.module.lambda_function.aws_s3_object.lambda_package[0] will be destroyed
  # (because aws_s3_object.lambda_package is not in configuration)
-   resource "aws_s3_object" "lambda_package" {
-       acl                    = "private" -> null
-       bucket                 = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "binary/octet-stream" -> null
-       etag                   = "2a4ad686b16d5f608f8e64d7405b0a8a-2" -> null
-       force_destroy          = false -> null
-       id                     = "builds/f97293dffef695cab655eeecc664e8c34c164ae0090612444da3fe68c81ec174.zip" -> null
-       key                    = "builds/f97293dffef695cab655eeecc664e8c34c164ae0090612444da3fe68c81ec174.zip" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "builds/f97293dffef695cab655eeecc664e8c34c164ae0090612444da3fe68c81ec174.zip" -> null
-       storage_class          = "ONEZONE_IA" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "grants-ingest"
-           "service"    = "grants-ingest"
-           "usage"      = "workload"
        } -> null
-       version_id             = "9uHcQ_fjZI0LxcvFT.6i5876XlR8ArnM" -> null
    }

  # module.download_grants_gov_db.module.lambda_function.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
-   resource "null_resource" "archive" {
-       id       = "2283001504856102766" -> null
-       triggers = {
-           "filename"  = "builds/f97293dffef695cab655eeecc664e8c34c164ae0090612444da3fe68c81ec174.zip"
-           "timestamp" = "1680314673201088000"
        } -> null
    }

  # module.download_grants_gov_db.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] will be destroyed
  # (because null_resource.sam_metadata_aws_lambda_function is not in configuration)
-   resource "null_resource" "sam_metadata_aws_lambda_function" {
-       id       = "1021931342575273674" -> null
-       triggers = {
-           "built_output_path"    = "builds/f97293dffef695cab655eeecc664e8c34c164ae0090612444da3fe68c81ec174.zip"
-           "original_source_code" = jsonencode(
                [
-                   {
-                       commands = [
-                           "task build-download_grants_gov_db",
-                           "cd bin/download_grants_gov_db",
-                           ":zip",
                        ]
-                       path     = "./.."
                    },
                ]
            )
-           "resource_name"        = "aws_lambda_function.this[0]"
-           "resource_type"        = "ZIP_LAMBDA_FUNCTION"
-           "source_code_property" = "path"
        } -> null
    }

  # module.split_grants_gov_db.module.lambda_function.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
-   resource "aws_cloudwatch_log_group" "lambda" {
-       arn               = "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       id                = "/aws/lambda/grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       name              = "/aws/lambda/grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       retention_in_days = 30 -> null
-       skip_destroy      = false -> null
-       tags              = {} -> null
-       tags_all          = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "grants-ingest"
-           "service"    = "grants-ingest"
-           "usage"      = "workload"
        } -> null
    }

  # module.split_grants_gov_db.module.lambda_function.aws_iam_policy.additional_json[0] will be destroyed
  # (because aws_iam_policy.additional_json is not in configuration)
-   resource "aws_iam_policy" "additional_json" {
-       arn       = "arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       id        = "arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       name      = "grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       path      = "/" -> null
-       policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = "secretsmanager:GetSecretValue"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:secretsmanager:us-west-2:357150818708:secret:grants_ingest-staging-datadog_api_key-JGC7E3"
-                       Sid      = "GetDatadogAPIKeySecretValue"
                    },
-                   {
-                       Action   = [
-                           "s3:ListBucket",
-                           "s3:GetObject",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:s3:::grantsingest-staging-grantsprepareddata-357150818708-us-west-2/*/*/grants.gov/v2.xml",
-                           "arn:aws:s3:::grantsingest-staging-grantsprepareddata-357150818708-us-west-2",
                        ]
-                       Sid      = "AllowInspectS3PreparedData"
                    },
-                   {
-                       Action   = "s3:GetObject"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2/sources/*/*/*/grants.gov/extract.xml"
-                       Sid      = "AllowS3DownloadSourceData"
                    },
-                   {
-                       Action   = "s3:PutObject"
-                       Effect   = "Allow"
-                       Resource = "arn:aws:s3:::grantsingest-staging-grantsprepareddata-357150818708-us-west-2/*/*/grants.gov/v2.xml"
-                       Sid      = "AllowS3UploadPreparedData"
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       policy_id = "ANPAVGJ6ZAGKEW2OFJE2C" -> null
-       tags      = {} -> null
-       tags_all  = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "grants-ingest"
-           "service"    = "grants-ingest"
-           "usage"      = "workload"
        } -> null
    }

  # module.split_grants_gov_db.module.lambda_function.aws_iam_policy.logs[0] will be destroyed
  # (because aws_iam_policy.logs is not in configuration)
-   resource "aws_iam_policy" "logs" {
-       arn       = "arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitGrantsGovXMLDB-logs" -> null
-       id        = "arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitGrantsGovXMLDB-logs" -> null
-       name      = "grants_ingest-staging-SplitGrantsGovXMLDB-logs" -> null
-       path      = "/" -> null
-       policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action   = [
-                           "logs:PutLogEvents",
-                           "logs:CreateLogStream",
-                           "logs:CreateLogGroup",
                        ]
-                       Effect   = "Allow"
-                       Resource = [
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-SplitGrantsGovXMLDB:*:*",
-                           "arn:aws:logs:us-west-2:357150818708:log-group:/aws/lambda/grants_ingest-staging-SplitGrantsGovXMLDB:*",
                        ]
-                       Sid      = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       policy_id = "ANPAVGJ6ZAGKPW4RIPFKP" -> null
-       tags      = {} -> null
-       tags_all  = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "grants-ingest"
-           "service"    = "grants-ingest"
-           "usage"      = "workload"
        } -> null
    }

  # module.split_grants_gov_db.module.lambda_function.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
-   resource "aws_iam_role" "lambda" {
-       arn                   = "arn:aws:iam::357150818708:role/grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       assume_role_policy    = jsonencode(
            {
-               Statement = [
-                   {
-                       Action    = "sts:AssumeRole"
-                       Effect    = "Allow"
-                       Principal = {
-                           Service = "lambda.amazonaws.com"
                        }
-                       Sid       = ""
                    },
                ]
-               Version   = "2012-10-17"
            }
        ) -> null
-       create_date           = "2023-03-31T14:41:13Z" -> null
-       force_detach_policies = true -> null
-       id                    = "grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       managed_policy_arns   = [
-           "arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitGrantsGovXMLDB",
-           "arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitGrantsGovXMLDB-logs",
        ] -> null
-       max_session_duration  = 3600 -> null
-       name                  = "grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       path                  = "/" -> null
-       permissions_boundary  = "arn:aws:iam::357150818708:policy/service-management-boundary" -> null
-       tags                  = {} -> null
-       tags_all              = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "grants-ingest"
-           "service"    = "grants-ingest"
-           "usage"      = "workload"
        } -> null
-       unique_id             = "AROAVGJ6ZAGKAN3AVTW2O" -> null
    }

  # module.split_grants_gov_db.module.lambda_function.aws_iam_role_policy_attachment.additional_json[0] will be destroyed
  # (because aws_iam_role_policy_attachment.additional_json is not in configuration)
-   resource "aws_iam_role_policy_attachment" "additional_json" {
-       id         = "grants_ingest-staging-SplitGrantsGovXMLDB-20230331144114091700000002" -> null
-       policy_arn = "arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       role       = "grants_ingest-staging-SplitGrantsGovXMLDB" -> null
    }

  # module.split_grants_gov_db.module.lambda_function.aws_iam_role_policy_attachment.logs[0] will be destroyed
  # (because aws_iam_role_policy_attachment.logs is not in configuration)
-   resource "aws_iam_role_policy_attachment" "logs" {
-       id         = "grants_ingest-staging-SplitGrantsGovXMLDB-20230331144114088400000001" -> null
-       policy_arn = "arn:aws:iam::357150818708:policy/grants_ingest-staging-SplitGrantsGovXMLDB-logs" -> null
-       role       = "grants_ingest-staging-SplitGrantsGovXMLDB" -> null
    }

  # module.split_grants_gov_db.module.lambda_function.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
-   resource "aws_lambda_function" "this" {
-       architectures                  = [
-           "arm64",
        ] -> null
-       arn                            = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       code_signing_config_arn        = "" -> null
-       description                    = "Creates per-grant XML data files from a source Grants.gov XML DB extract." -> null
-       function_name                  = "grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       handler                        = "bootstrap" -> null
-       id                             = "grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       image_uri                      = "" -> null
-       invoke_arn                     = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB/invocations" -> null
-       kms_key_arn                    = "" -> null
-       last_modified                  = "2023-04-01T02:05:09.000+0000" -> null
-       layers                         = [
-           "arn:aws:lambda:us-west-2:464622532012:layer:Datadog-Extension-ARM:38",
        ] -> null
-       memory_size                    = 1024 -> null
-       package_type                   = "Zip" -> null
-       publish                        = true -> null
-       qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:2" -> null
-       qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:grants_ingest-staging-SplitGrantsGovXMLDB:2/invocations" -> null
-       reserved_concurrent_executions = -1 -> null
-       role                           = "arn:aws:iam::357150818708:role/grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       runtime                        = "provided.al2" -> null
-       s3_bucket                      = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2" -> null
-       s3_key                         = "builds/23a0e37147c3e3a7d65600e39737789ef9477bc0d50364e9cd436ee963610200.zip" -> null
-       s3_object_version              = "nG2IPek9QPAj5cimCiqmr.YELYj6pgJA" -> null
-       signing_job_arn                = "" -> null
-       signing_profile_version_arn    = "" -> null
-       source_code_hash               = "/J5RWGLtNYpBZwSPDrGJ7dFup1fgQLtMTxTrxmt4JZk=" -> null
-       source_code_size               = 6772349 -> null
-       tags                           = {} -> null
-       tags_all                       = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "grants-ingest"
-           "service"    = "grants-ingest"
-           "usage"      = "workload"
        } -> null
-       timeout                        = 300 -> null
-       version                        = "2" -> null

-       environment {
-           variables = {
-               "DD_API_KEY_SECRET_ARN"            = (sensitive value)
-               "DD_APM_ENABLED"                   = "true"
-               "DD_CAPTURE_LAMBDA_PAYLOAD"        = "true"
-               "DD_ENV"                           = "staging"
-               "DD_SERVERLESS_APPSEC_ENABLED"     = "true"
-               "DD_SERVICE"                       = "grants-ingest"
-               "DD_SITE"                          = "datadoghq.com"
-               "DD_TAGS"                          = "functionname:splitgrantsgovxmldb"
-               "DD_TRACE_ENABLED"                 = "true"
-               "DD_TRACE_RATE_LIMIT"              = "1000"
-               "DD_VERSION"                       = "9253eef759c6c58f46e3ac0e274052c3c2422bb9"
-               "DOWNLOAD_CHUNK_LIMIT"             = "20"
-               "GRANTS_PREPARED_DATA_BUCKET_NAME" = "grantsingest-staging-grantsprepareddata-357150818708-us-west-2"
-               "LOG_LEVEL"                        = "INFO"
-               "MAX_CONCURRENT_UPLOADS"           = "10"
-               "S3_USE_PATH_STYLE"                = "true"
-               "TZ"                               = "UTC"
            } -> null
        }

-       ephemeral_storage {
-           size = 512 -> null
        }

-       tracing_config {
-           mode = "PassThrough" -> null
        }
    }

  # module.split_grants_gov_db.module.lambda_function.aws_lambda_permission.current_version_triggers["S3BucketNotification"] will be destroyed
  # (because aws_lambda_permission.current_version_triggers is not in configuration)
-   resource "aws_lambda_permission" "current_version_triggers" {
-       action        = "lambda:InvokeFunction" -> null
-       function_name = "grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       id            = "S3BucketNotification" -> null
-       principal     = "s3.amazonaws.com" -> null
-       qualifier     = "2" -> null
-       source_arn    = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> null
-       statement_id  = "S3BucketNotification" -> null
    }

  # module.split_grants_gov_db.module.lambda_function.aws_lambda_permission.unqualified_alias_triggers["S3BucketNotification"] will be destroyed
  # (because aws_lambda_permission.unqualified_alias_triggers is not in configuration)
-   resource "aws_lambda_permission" "unqualified_alias_triggers" {
-       action        = "lambda:InvokeFunction" -> null
-       function_name = "grants_ingest-staging-SplitGrantsGovXMLDB" -> null
-       id            = "S3BucketNotification" -> null
-       principal     = "s3.amazonaws.com" -> null
-       source_arn    = "arn:aws:s3:::grantsingest-staging-grantssourcedata-357150818708-us-west-2" -> null
-       statement_id  = "S3BucketNotification" -> null
    }

  # module.split_grants_gov_db.module.lambda_function.aws_s3_object.lambda_package[0] will be destroyed
  # (because aws_s3_object.lambda_package is not in configuration)
-   resource "aws_s3_object" "lambda_package" {
-       acl                    = "private" -> null
-       bucket                 = "grantsingest-staging-lambdaartifacts-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "binary/octet-stream" -> null
-       etag                   = "74a4a7227d3719b1ae308859e5a7c658-2" -> null
-       force_destroy          = false -> null
-       id                     = "builds/23a0e37147c3e3a7d65600e39737789ef9477bc0d50364e9cd436ee963610200.zip" -> null
-       key                    = "builds/23a0e37147c3e3a7d65600e39737789ef9477bc0d50364e9cd436ee963610200.zip" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "builds/23a0e37147c3e3a7d65600e39737789ef9477bc0d50364e9cd436ee963610200.zip" -> null
-       storage_class          = "ONEZONE_IA" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "grants-ingest"
-           "service"    = "grants-ingest"
-           "usage"      = "workload"
        } -> null
-       version_id             = "nG2IPek9QPAj5cimCiqmr.YELYj6pgJA" -> null
    }

  # module.split_grants_gov_db.module.lambda_function.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
-   resource "null_resource" "archive" {
-       id       = "4077147972819913241" -> null
-       triggers = {
-           "filename"  = "builds/23a0e37147c3e3a7d65600e39737789ef9477bc0d50364e9cd436ee963610200.zip"
-           "timestamp" = "1680314673227884000"
        } -> null
    }

  # module.split_grants_gov_db.module.lambda_function.null_resource.sam_metadata_aws_lambda_function[0] will be destroyed
  # (because null_resource.sam_metadata_aws_lambda_function is not in configuration)
-   resource "null_resource" "sam_metadata_aws_lambda_function" {
-       id       = "1602254871386549882" -> null
-       triggers = {
-           "built_output_path"    = "builds/23a0e37147c3e3a7d65600e39737789ef9477bc0d50364e9cd436ee963610200.zip"
-           "original_source_code" = jsonencode(
                [
-                   {
-                       commands = [
-                           "task build-split_grants_gov_xml_db",
-                           "cd bin/split_grants_gov_xml_db",
-                           ":zip",
                        ]
-                       path     = "./.."
                    },
                ]
            )
-           "resource_name"        = "aws_lambda_function.this[0]"
-           "resource_type"        = "ZIP_LAMBDA_FUNCTION"
-           "source_code_property" = "path"
        } -> null
    }

Plan: 30 to add, 0 to change, 28 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/grants-ingest/actions/runs/4602853649)*